# StructuralSectionCommonShearAreaStrongAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionCommonShearAreaStrongAxis Property
ParameterTypeId Class See Also
---
"Shear Area strong axis"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionCommonShearAreaStrongAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionCommonShearAreaStrongAxis As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionCommonShearAreaStrongAxis {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace